#include "pch.h"
#include "Component_DistortionEffect.h"


//*---------------------------------------------------------------------------------------
//*【?】コンストラクタ
//* [引数]
//* pOwner : オーナーオブジェクト
//* updateRank : 更新レイヤー
//*----------------------------------------------------------------------------------------
DistortionEffect::DistortionEffect(std::weak_ptr<GameObject> pOwner, int updateRank)
   :IComponent(pOwner, updateRank)
{
    this->set_Tag("DistortionEffect");
}

//*---------------------------------------------------------------------------------------
//*【?】デストラクタ
//*----------------------------------------------------------------------------------------
DistortionEffect::~DistortionEffect()
{

}

//*---------------------------------------------------------------------------------------
//*【?】初期化
//*
//* [引数]
//* &renderer : 描画エンジンの参照
//* [返値]なし
//*----------------------------------------------------------------------------------------
void DistortionEffect::Start(RendererEngine& renderer)
{
}

//*---------------------------------------------------------------------------------------
//*【?】更新
//*
//* [引数]
//* &renderer : 描画エンジンの参照
//* [返値]なし
//*----------------------------------------------------------------------------------------
void DistortionEffect::Update(RendererEngine& renderer)
{
}

//*---------------------------------------------------------------------------------------
//*【?】描画
//*
//* [引数]
//* &renderer : 描画エンジンの参照
//* [返値]なし
//*----------------------------------------------------------------------------------------
void DistortionEffect::Draw(RendererEngine& renderer)
{
}

