#include "pch.h"
#include "RandomManager.h"

//*---------------------------------------------------------------------------------------
//*【?】コンストラクタ
//*----------------------------------------------------------------------------------------
RandomManager::RandomManager()
{

}

//*---------------------------------------------------------------------------------------
//*【?】デストラクタ
//*----------------------------------------------------------------------------------------
RandomManager::~RandomManager()
{

}

//*---------------------------------------------------------------------------------------
//*【?】初期化
//*
//* [引数] 
//* なし
//* [返値]
//* true : 成功
//* false : 失敗
//*----------------------------------------------------------------------------------------
bool RandomManager::Init()
{
    // シード値生成
    std::random_device seed_gen;

    // ランダム生成エンジンの初期化
    m_RandomEngine.seed(seed_gen());

    return true;
}

//*---------------------------------------------------------------------------------------
//*【?】Int型のランダム値取得
//*
//* [引数] 
//* _min : 最小値
//* _max : 最大値
//* [返値]
//* int : ランダム値
//*----------------------------------------------------------------------------------------
int RandomManager::GetIntRandom(int _min, int _max)
{
    std::uniform_int_distribution<int>dist(_min, _max);
    return dist(m_RandomEngine);
}

//*---------------------------------------------------------------------------------------
//*【?】float型のランダム値取得
//*
//* [引数] 
//* _min : 最小値
//* _max : 最大値
//* [返値]
//* float : ランダム値
//*----------------------------------------------------------------------------------------
float RandomManager::GetFloatRandom(float _min, float _max)
{
    std::uniform_real_distribution<float>dist(_min, _max);
    return dist(m_RandomEngine);
}